TestCases/oversetArcGrowth/Main/0/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1486
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    overOut5
    {
        type            overset;
        value           uniform 1;
    }
    overOut6
    {
        type            overset;
        value           uniform 1;
    }
    overOut7
    {
        type            overset;
        value           uniform 1;
    }
    overOut8
    {
        type            overset;
        value           uniform 1;
    }
    overOut9
    {
        type            overset;
        value           uniform 1;
    }
    overOut10
    {
        type            overset;
        value           uniform 1;
    }
    overOut11
    {
        type            overset;
        value           uniform 1;
    }
    overOut12
    {
        type            overset;
        value           uniform 1;
    }
    overOut13
    {
        type            overset;
        value           uniform 1;
    }
    overOut14
    {
        type            overset;
        value           uniform 1;
    }
    overOut15
    {
        type            overset;
        value           uniform 1;
    }
    arcEnd
    {
        type            zeroGradient;
    }
    arcOut15
    {
        type            zeroGradient;
    }
    arcOut14
    {
        type            zeroGradient;
    }
    arcOut13
    {
        type            zeroGradient;
    }
    arcOut12
    {
        type            zeroGradient;
    }
    arcOut11
    {
        type            zeroGradient;
    }
    arcOut10
    {
        type            zeroGradient;
    }
    arcOut9
    {
        type            zeroGradient;
    }
    arcOut8
    {
        type            zeroGradient;
    }
    arcOut7
    {
        type            zeroGradient;
    }
    arcOut6
    {
        type            zeroGradient;
    }
    arcOut5
    {
        type            zeroGradient;
    }
    arcOut4
    {
        type            zeroGradient;
    }
    arcOut3
    {
        type            zeroGradient;
    }
    arcOut2
    {
        type            zeroGradient;
    }
    arcOut1
    {
        type            zeroGradient;
    }
    arcStart
    {
        type            zeroGradient;
    }
    overOut1
    {
        type            overset;
        value           uniform 1;
    }
    overOut2
    {
        type            overset;
        value           uniform 1;
    }
    overOut3
    {
        type            overset;
        value           uniform 1;
    }
    overOut4
    {
        type            overset;
        value           uniform 1;
    }
    arcIn3
    {
        type            zeroGradient;
    }
    arcIn4
    {
        type            zeroGradient;
    }
    arcIn5
    {
        type            zeroGradient;
    }
    arcIn6
    {
        type            zeroGradient;
    }
    arcIn7
    {
        type            zeroGradient;
    }
    arcIn8
    {
        type            zeroGradient;
    }
    arcIn9
    {
        type            zeroGradient;
    }
    arcIn10
    {
        type            zeroGradient;
    }
    arcIn11
    {
        type            zeroGradient;
    }
    arcIn12
    {
        type            zeroGradient;
    }
    arcIn13
    {
        type            zeroGradient;
    }
    arcIn14
    {
        type            zeroGradient;
    }
    arcIn15
    {
        type            zeroGradient;
    }
    overIn15
    {
        type            overset;
        value           uniform 1;
    }
    overIn14
    {
        type            overset;
        value           uniform 1;
    }
    overIn13
    {
        type            overset;
        value           uniform 1;
    }
    overIn12
    {
        type            overset;
        value           uniform 1;
    }
    overIn11
    {
        type            overset;
        value           uniform 1;
    }
    overIn10
    {
        type            overset;
        value           uniform 1;
    }
    overIn9
    {
        type            overset;
        value           uniform 1;
    }
    overIn8
    {
        type            overset;
        value           uniform 1;
    }
    overIn7
    {
        type            overset;
        value           uniform 1;
    }
    overIn6
    {
        type            overset;
        value           uniform 1;
    }
    overIn5
    {
        type            overset;
        value           uniform 1;
    }
    overIn4
    {
        type            overset;
        value           uniform 1;
    }
    overIn3
    {
        type            overset;
        value           uniform 1;
    }
    overIn2
    {
        type            overset;
        value           uniform 1;
    }
    overIn1
    {
        type            overset;
        value           uniform 1;
    }
    arcIn1
    {
        type            zeroGradient;
    }
    arcIn2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
